Repository: Doozers/pathwar
Catalog: challenges/web/training-include/front/translations/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: ...Or not?
fr_fr: Ou pas?

source: A lot of them are homemade, with serious but subtle security flaws.
fr_fr: Beaucoup sont faits maison, avec des sérieux mais subtiles défauts de sécurité.

source: By browsing the awesome <a href="https://www.owasp.org/index.php/Testing_for_Local_File_Inclusion">OWASP</a> website, we learn that:
fr_fr: En parcourant l'impressionnant site <a href="https://www.owasp.org/index.php/Testing_for_Local_File_Inclusion">OWASP</a> nous apprenons que:

source: Click here to continue
fr_fr: Cliquez ici pour continuer

source: Code execution on the client-side such as JavaScript which can lead to other attacks such as cross site scripting (XSS)
fr_fr: Exécution de code coté client, comme javascript qui peut aboutir à d'autres attaques comme "cross site scripting (XSS)"

source: Code execution on the web server
fr_fr: Exécution de code sur le serveur web

source: Continue
fr_fr: Continuer

source: Continue...
fr_fr: Continuer...

source: Denial of Service (DoS)
fr_fr: Deni de service (Denial of Service DOS)

source: Depending on your background, perhaps now you can envision a more nefarious file inclusion, e.g. a MySQL my.cnf config file.
fr_fr: En fonction de votre contexte, maintenant vous pouvez peut-être envisager l'exploitation d'une inclusion plus critique. Le fichier de configuration de MySQL my.cnf par exemple.

source: Enjoy!
fr_fr: Profitez!

source: For example, you could expose the contents of the server's <b>/etc/passwd</b> file by <a href="?page=../../../../../etc/passwd" target="_blank">clicking here</a>.
fr_fr: Par exemple, vous pourriez afficher le contenu du fichier du serveur <b>/etc/passwd</b> en <a href="?page=../../../../../etc/passwd" target="_blank">suivant ce lien</a>.

source: Happy Hacking!
fr_fr: Joyeux Hacking!

source: Here you'll learn how to exploit them.
fr_fr: Nous allons apprendre comment les exploiter.

source: If you click
fr_fr: Si vous cliquez

source: Impressed? This is nothing compared to what you'll learn later!
fr_fr: Impressionnant? Ce n'est rien comparé à ce que vous allez apprendre plus tard!

source: In order for our request to override it, a technique with <a href="http://php.net/manual/en/security.filesystem.nullbytes.php">null-byte terminators</a> is used, and we request <b>/index.php?page=../../../../../etc/passwd%00</b> instead.
fr_fr: Pour notre requête, afin de passer outre, une technique <a href="http://php.net/manual/en/security.filesystem.nullbytes.php"> "null-byte terminators"</a> est utilisée. Nous requêtons <b>/index.php?page=../../../../../etc/passwd%00</b> à la place.

source: Notice the <b>.php</b> suffix that's automatically added.
fr_fr: Remarques que le suffixe <b>.php</b> est ajouté automatiquement.

source: Sensitive Information Disclosure
fr_fr: Divulgation d'information sensible

source: So, we're seeing a lot of websites using an <a href="http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a> architecture.
fr_fr: Nous voyons beaucoup de sites utilisant une structure <a href="https://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller">MVC</a>

source: Some PHP configurations even allow URL include...
fr_fr: Certaines configurations PHP permettent toujours l'inclusion dans l'URL....

source: That's because the code that retrieves the page looks like this:
fr_fr: C'est parce que le code qui génère cette page ressemble à:

source: The File Inclusion vulnerability allows an attacker to include a file, usually exploiting a "dynamic file inclusion" mechanisms implemented in the target application. The vulnerability occurs due to the use of user-supplied input without proper validation.
fr_fr: La vulnérabilité "File inclusion" permet à un attaquant d'inclure un nom de fichier, généralement en exploitant un mécanisme d'"inclusions dynamiques" implémenté sur l'application cible. Cette vulnérabilité est due à un manque de vérification des entrées (noms de fichiers, urls etc...) fournies par l'utilisateur.

source: The null-byte termination vulnerability was fixed in PHP 5.3.4. But since the Internet is full of deprecated PHP, this is not obsolete knowledge!
fr_fr: La vulnérabilité "null-byte termination" a été corrigée avec PHP 5.3.4. Mais comme internet est plein de sites PHP obsolètes, c'est bon de le savoir.

source: This can allow attackers to simply output the contents of the file onto a page, or, more seriously, enable:
fr_fr: Çà peut permettre à l'attaquant d'afficher le contenu d'un fichier dans la page, ou plus grave, activer:

source: We're going to include a file called
fr_fr: Nous allons inclure un fichier nommé

source: Welcome to the Pathwar <b>Include</b> Training
fr_fr: Bienvenue au Challange Pathwar Entrainement <b>include</b>

source: You'll want to play with this stuff to build a handy skillset for the challenges ahead...
fr_fr: Vous allez vouloir jouer avec ce truc pour obtenir des outils pour les prochains challanges...

source: here
fr_fr: Ici

source: you'll be able to list all the files in this directory!
fr_fr: Vous serez capable de lister tous les fichiers de ce répertoire!
